[{"like": "Best team and seniors to work with .Excellent training by world class trainers with best work experience in world.Apple is best to work ", "dislike": "It’s a third for sales people.And growth opportunities are limited after a certain level"}, {"like": "I would to share my apple company experience I feel proud be part of this top company nd I learn a lot from these company and also develop me skills after joining in apple I was attend a went to various places for training session and thanks to apple giving a lot thing which I was got ", "dislike": "Dislike means there is not major dislike but the incentive scheme is not good and company has not giving rewards like depend on my achievements "}, {"like": "Apple is the best organisations in my life,but in third party salry and incentive is  not satisfied as per current life style. ..and current cost...", "dislike": "In apple everything is very exciting and good. In third party perol (manpower group) HR r very humble and helpfull..and the punctuality is very very good in terms of payment..but salary and incentive is not enough for life leading."}, {"like": "As we know Apple is very big and reputed company and everybody wants to work with Apple and the culture of that company is very good and i learn lots of thing from Apple .", "dislike": "\r\nAnd that company in my blood i will never left that company 😊"}, {"like": "It is a honour to be an employee of Apple.  Our Asm is like our father who always learing us about sales and everything and also help us to save our job everytime.  Environment is unbelievable. Salary is also great. In every training we have learn many new things lots of innovation.", "dislike": "No dislike at all. I am proud to be an employee of the company like Apple"}, {"like": "Team spirit and all staff coordination", "dislike": "Salary/appraisal and career growth."}, {"like": "I like nature of work amazing training experience and job satisfaction.", "dislike": "mostly Apple hire for third party pay roll so they can increase opportunities how want to work as Apple Pay roll"}, {"like": "Learning about new product knowledge.", "dislike": "\r\nOur company treat us very well. Happy with my current organisation."}, {"like": "Flexible timings ", "dislike": "Job role. Third party work environment "}, {"like": "Job security , salary and appraisal , work enviornment ", "dislike": "Work-life balance"}]